### Cvičení - opakování 

Máte k dispozici seznam dětí. Některé jsou ve skupině berušky, jiné ve skupině tygřici.

Spočítejte, kolik je děti v každé skupině a vytiskněte toto číslo. Pro tento účel využijte funkci `str.format()`.
Vytiskněte taky abecedně seřazené seznamy děti v každé skupině zvlášť.

In [1]:
kids = {
    'Pavla':'berušky', 'Ondřej':'tygříci', 'Jakub':'berušky', 'Klára':'berušky', 'Magdaléna':'tygříci', 
    'Vojtěch':'berušky', 'Jan':'tygříci', 'Filip':'tygříci', 'Daniel':'tygříci', 'Michaela':'berušky', 
    'Markéta':'tygříci'
}

In [2]:
group1 = []
group1_num = 0
group2 = []
group2_num = 0

In [3]:
for k, v in kids.items():
    if v == 'berušky':
        group1_num += 1
        group1.append(k)
    if v == 'tygříci':
        group2_num += 1
        group2.append(k)

In [4]:
print(
    'Ve skupině berušky je {0} dětí. Ve skupině tygříci je {1} dětí.'.format(group1_num, group2_num))

Ve skupině berušky je 5 dětí. Ve skupině tygříci je 6 dětí.

In [5]:
group1.sort()
group1

['Jakub', 'Klára', 'Michaela', 'Pavla', 'Vojtěch']

In [6]:
group2.sort()
group2

['Daniel', 'Filip', 'Jan', 'Magdaléna', 'Markéta', 'Ondřej']

### Cvičení - list comprehensions

Vytvořte seznam svých pěti kamarádů
Pomocí list comprehensions vytvořte z tohoto seznamu další seznam, který ke každému jménu přidá ' je super!'
Vytiskněte vytvořený seznam

In [7]:
friends = ['Pavla', 'Pavel', 'Vojta', 'Jitka', 'Veronika']
friends_super = [friend + ' je super!' for friend in friends]
friends_super

['Pavla je super!',
 'Pavel je super!',
 'Vojta je super!',
 'Jitka je super!',
 'Veronika je super!']

### Cvičení - Series

Vytvořte `Series`, kde index bude 5 dni (včetně dnešního dne) a data bude teplota.

Nápověda použijte `pd.date_range` a `pd.datetime.now().date()`

In [1]:
import pandas as pd
days = pd.date_range(end = pd.datetime.now().date(), periods=5, freq='D')
days

DatetimeIndex(['2017-10-08', '2017-10-09', '2017-10-10', '2017-10-11',
               '2017-10-12'],
              dtype='datetime64[ns]', freq='D')

In [9]:
temp = [14,15,15,14,14]
day_temp = pd.Series(temp, index = days, name='temp')
day_temp

2017-10-07    14
2017-10-08    15
2017-10-09    15
2017-10-10    14
2017-10-11    14
Freq: D, Name: temp, dtype: int64

### Cvičení - DataFrame 

Anna a Hanka chtějí jít do Neklidu, Jana a Jitka do Sladkovského, Karel a Jirka do café V lese.

Vytvořte `DataFrame` se sloupci `"Jméno"` a `"Hospoda"`.

In [10]:
pubs = {
    'Jméno' : ['Anna', 'Hanka', 'Jana', 'Jitka', 'Karel', 'Jirka'],
    'Hospoda' : ['Neklid', 'Neklid','Sladkovský', 'Sladkovský', 'café V lese', 'café V lese']
}

In [11]:
import pandas as pd

In [12]:
pubs_df = pd.DataFrame(pubs)
pubs_df

       Hospoda  Jméno
0       Neklid   Anna
1       Neklid  Hanka
2   Sladkovský   Jana
3   Sladkovský  Jitka
4  café V lese  Karel
5  café V lese  Jirka

### Cvičení - Tida data
Stáhněte data - [počty telefonů](https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/datasets/WorldPhones.csv)

Přetransformujte data tak, aby měla 3 sloupce: kontinent, rok, počet telefonů

In [2]:
link = 'https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/datasets/WorldPhones.csv'
phones = pd.read_csv(link)
phones

   Unnamed: 0  N.Amer  Europe  Asia  S.Amer  Oceania  Africa  Mid.Amer
0        1951   45939   21574  2876    1815     1646      89       555
1        1956   60423   29990  4708    2568     2366    1411       733
2        1957   64721   32510  5230    2695     2526    1546       773
3        1958   68484   35218  6662    2845     2691    1663       836
4        1959   71799   37598  6856    3000     2868    1769       911
5        1960   76036   40341  8220    3145     3054    1905      1008
6        1961   79831   43173  9053    3338     3224    2005      1076

In [3]:
phones.rename(columns={'Unnamed: 0':'Year'}, inplace=True)

In [10]:
phones.shape

(7, 8)

In [7]:
phones_melted = pd.melt(phones, 
                        id_vars=['Year'], 
                        value_vars=[
                            "N.Amer","Europe","Asia","S.Amer",
                            "Oceania","Africa","Mid.Amer"])

In [11]:
phones_melted.shape

(49, 3)

In [9]:
phones_melted.columns = ['Year', 'Continent', 'Telephone_number']
phones_melted.head()

   Year Continent  Telephone_number
0  1951    N.Amer             45939
1  1956    N.Amer             60423
2  1957    N.Amer             64721
3  1958    N.Amer             68484
4  1959    N.Amer             71799

### Cvičení - výběr podmnožiny dat 1

Z `titanic` dat:
    
    1. Vyberte prvních 20 řádků
    2. Ponechte sloupci obsahující jméno, pohlaví, věk, kde nastupovali a zda přežili    
    3. Spočítejte popisnou statistiku pro všechny sloupce

In [12]:
titanic = pd.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [13]:
titanic_sub = titanic.loc[:20, ['survived', 'name', 'sex', 'age', 'embarked']]

In [14]:
titanic_sub.describe(include = 'all')

         survived                          name   sex        age embarked
count   21.000000                            21    21  20.000000       21
unique        NaN                            21     2        NaN        2
top           NaN  Barber, Miss. Ellen "Nellie"  male        NaN        S
freq          NaN                             1    11        NaN       13
mean     0.571429                           NaN   NaN  36.745835      NaN
std      0.507093                           NaN   NaN  20.467834      NaN
min      0.000000                           NaN   NaN   0.916700      NaN
25%      0.000000                           NaN   NaN  24.750000      NaN
50%      1.000000                           NaN   NaN  34.000000      NaN
75%      1.000000                           NaN   NaN  48.500000      NaN
max      1.000000                           NaN   NaN  80.000000      NaN

### Cvičení - výběr podmnožiny dat 2

Spočítejte, kolik procent lidi nastupovalo v Queenstown?

In [38]:
(titanic[titanic.embarked == 'Q'].shape[0]/titanic.shape[0])*100

9.396485867074103

### Cvičení - výběr podmnožiny dat 3

Použíjte `titanic` data a spočítejte, u kolika procent osob, které nepřežili, bylo nalezeno tělo.

In [22]:
titanic_dead = titanic.loc[titanic.survived == 0]
titanic_dead.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
2,1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [41]:
(titanic_dead[titanic_dead.body.notnull()].shape[0]/titanic_dead.shape[0])*100

14.956736711990112

### Cvičení - práce s řetězci ve sloupcích

Spočítejte, kolik pasažerů mají jenom jedno křestní jméno? (Nápověda, použijte funkci `str.len()`)

In [55]:
titanic['first_name'] = titanic['name'].str.split(', ').str.get(1).str.split('\\. ').str.get(1)
titanic[titanic.first_name.str.split(' ').str.len() == 1].shape[0]

464

### Cvičení - seskupování

Zjistěte, ve kterém záchranném člunu bylo nejvíce lidí? (Nápověda, použijte funkci `groupby()` a `argmax()`)

In [69]:
titanic.boat.unique()

array([2, '11', nan, '3', '10', 'D', '4', '9', '6', 'B', '8', 'A', '5',
       '7', 'C', '14', '2', '5 9', '13', '1', '15', '5 7', '8 10', '12',
       '16', '13 15 B', 'C D', '15 16', '13 15'], dtype=object)

In [75]:
titanic.name.groupby(titanic.boat).count().argmax()

'13'